:PROPERTIES:
:ID:       c083bf0c-9ded-4d2a-bfe0-0d7bd3134815
:END:
#+title: Rust pointers
#+filetags: :project:rust:
Pointer types to DSTs are sized but have twice the size of pointers to sized types
Pointers to slices also store the number of elements of the slice.
Pointers to trait objects also store a pointer to a vtable.
*** TODO [#A] auto-dereferencing rules
:PROPERTIES:
:ID:       6b24a165-4512-43e3-bb1e-e886f39c67cf
:ROAM_REFS: https://stackoverflow.com/a/28552082/6086311

:END:
#+begin_src rust
struct X { val: i32 }
struct Y { val: i32 }
struct Z { val: Y }
#[derive(Clone, Copy)]
struct A;

impl std::ops::Deref for X {
    type Target = i32;
    fn deref(&self) -> &i32 { &self.val }
}

impl std::ops::Deref for Y {
    type Target = i32;
    fn deref(&self) -> &i32 { &self.val }
}

impl std::ops::Deref for Z {
    type Target = Y;
    fn deref(&self) -> &Y { &self.val }
}

trait M { fn m(self); }
trait RefM { fn refm(&self); }

impl M for i32   { fn m(self) { println!("i32::m()");  } }
impl M for X     { fn m(self) { println!("X::m()");    } }
impl M for &X    { fn m(self) { println!("&X::m()");   } }
impl M for &&X   { fn m(self) { println!("&&X::m()");  } }
impl M for &&&X  { fn m(self) { println!("&&&X::m()"); } }

impl RefM for i32  { fn refm(&self) { println!("i32::refm()");  } }
impl RefM for X    { fn refm(&self) { println!("X::refm()");    } }
impl RefM for &X   { fn refm(&self) { println!("&X::refm()");   } }
impl RefM for &&X  { fn refm(&self) { println!("&&X::refm()");  } }
impl RefM for &&&X { fn refm(&self) { println!("&&&X::refm()"); } }

impl M for    A { fn m(self) { println!("A::m()");    } }
impl M for &&&A { fn m(self) { println!("&&&A::m()"); } }

impl RefM for    A { fn refm(&self) { println!("A::refm()");    } }
impl RefM for &&&A { fn refm(&self) { println!("&&&A::refm()"); } }


fn main() {
    // I'll use @ to denote left side of the dot operator
    (*X{val:42}).m();        // i32::m()    , Self == @
    X{val:42}.m();           // X::m()      , Self == @
    (&X{val:42}).m();        // &X::m()     , Self == @
    (&&X{val:42}).m();       // &&X::m()    , Self == @
    (&&&X{val:42}).m();      // &&&X:m()    , Self == @
    (&&&&X{val:42}).m();     // &&&X::m()   , Self == *@
    (&&&&&X{val:42}).m();    // &&&X::m()   , Self == **@
    println!("-------------------------");

    (*X{val:42}).refm();     // i32::refm() , Self == @
    X{val:42}.refm();        // X::refm()   , Self == @
    (&X{val:42}).refm();     // X::refm()   , Self == *@
    (&&X{val:42}).refm();    // &X::refm()  , Self == *@
    (&&&X{val:42}).refm();   // &&X::refm() , Self == *@
    (&&&&X{val:42}).refm();  // &&&X::refm(), Self == *@
    (&&&&&X{val:42}).refm(); // &&&X::refm(), Self == **@
    println!("-------------------------");

    Y{val:42}.refm();        // i32::refm() , Self == *@
    Z{val:Y{val:42}}.refm(); // i32::refm() , Self == **@
    println!("-------------------------");

    A.m();                   // A::m()      , Self == @
    // without the Copy trait, (&A).m() would be a compilation error:
    // cannot move out of borrowed content
    (&A).m();                // A::m()      , Self == *@
    (&&A).m();               // &&&A::m()   , Self == &@
    (&&&A).m();              // &&&A::m()   , Self == @
    A.refm();                // A::refm()   , Self == @
    (&A).refm();             // A::refm()   , Self == *@
    (&&A).refm();            // A::refm()   , Self == **@
    (&&&A).refm();           // &&&A::refm(), Self == @
}

#+end_src

#+RESULTS:
#+begin_example
i32::m()
X::m()
&X::m()
&&X::m()
&&&X::m()
&&&X::m()
&&&X::m()
-------------------------
i32::refm()
X::refm()
X::refm()
&X::refm()
&&X::refm()
&&&X::refm()
&&&X::refm()
-------------------------
i32::refm()
i32::refm()
-------------------------
A::m()
A::m()
&&&A::m()
&&&A::m()
A::refm()
A::refm()
A::refm()
&&&A::refm()
#+end_example
*** mutable reference to immutable variable
#+begin_src rust :exports both
fn main() {
    let x = 5;
    let y = &mut x;
    ,*y = 8;
}
#+end_src

#+RESULTS:
: error[E0596]: cannot borrow `x` as mutable, as it is not declared as mutable

*** immutable reference to mutable variable
#+begin_src rust :exports both
fn main() {
    let mut x = 5;
    let y = &x;
    *y = 8;
}
#+end_src

#+RESULTS:
: error[E0594]: cannot assign to `*y`, which is behind a `&` reference
: |     let y = &x;
: |             -- help: consider changing this to be a mutable reference: `&mut x`
: |     *y = 8;
: |     ^^^^^^ `y` is a `&` reference, so the data it refers to cannot be written

